agusibrahim/esp-fcm-arduino/src/fcm_mcs_esp8266.cpp
#if defined(ESP8266) || defined(ARDUINO_ARCH_ESP8266)

#include "FCMReceiver.h"
#include "fcm_proto.h"
#include "fcm_root_ca.h"

#include <ESP8266WiFi.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClientSecureBearSSL.h>
#include <inttypes.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <LittleFS.h>

#define MCS_HOST         "mtalk.google.com"
#define MCS_PORT         5228
#define KMCS_VERSION     41
#define K_LOGIN_REQUEST_TAG   2
#define TAG_HEARTBEAT_PING    0
#define TAG_HEARTBEAT_ACK     1
#define TAG_LOGIN_RESPONSE    3
#define TAG_CLOSE             4
#define TAG_IQ_STANZA         7
#define TAG_DATA_MESSAGE      8
#ifndef FCM_READ_BUF_SIZE
#define FCM_READ_BUF_SIZE 8192
#endif

const fcm_config_t *s_current_config = NULL;
static uint32_t g_fcm_heartbeat_interval_ms = 600000UL;
static fcm_should_stop_cb_t s_should_stop_cb = NULL;
static uint64_t s_last_ts = 0;
static bool s_ts_loaded = false;
static fcm_message_t *s_pending_server_msg = NULL;
static fcm_message_cb_t s_pending_callback = NULL;

static uint64_t parse_pid_timestamp(const char *persistent_id);
static void save_last_timestamp(uint64_t ts);

extern "C" void fcm_set_heartbeat_interval(uint32_t seconds) {
    g_fcm_heartbeat_interval_ms = seconds * 1000UL;
}

extern "C" void fcm_set_should_stop_callback(fcm_should_stop_cb_t callback) {
    s_should_stop_cb = callback;
}

extern "C" esp_err_t fcm_mark_message_processed(const char *persistent_id) {
    uint64_t ts = parse_pid_timestamp(persistent_id);
    if (ts == 0) return ESP_ERR_INVALID_ARG;
    if (ts > s_last_ts) save_last_timestamp(ts);
    return ESP_OK;
}

static uint64_t parse_pid_timestamp(const char *persistent_id) {
    if (!persistent_id || !persistent_id[0]) return 0;
    const char *colon = strchr(persistent_id, ':');
    if (!colon) return 0;
    return strtoull(colon + 1, NULL, 10);
}

static void load_last_timestamp(void) {
    if (s_ts_loaded) return;
    s_ts_loaded = true;
    if (!LittleFS.begin()) return;
    File f = LittleFS.open("/fcm_last_ts", "r");
    if (!f) return;
    s_last_ts = strtoull(f.readString().c_str(), NULL, 10);
    f.close();
}

static void save_last_timestamp(uint64_t ts) {
    s_last_ts = ts;
    if (!LittleFS.begin()) return;
    File f = LittleFS.open("/fcm_last_ts", "w");
    if (!f) return;
    f.print((unsigned long long)ts);
    f.close();
}

typedef struct {
    uint8_t *data;
    size_t capacity;
    size_t head;
    size_t tail;
    size_t length;
} ringbuf_t;

static void rb_init(ringbuf_t *rb, size_t capacity) {
    rb->data = (uint8_t *)malloc(capacity);
    rb->capacity = rb->data ? capacity : 0;
    rb->head = 0;
    rb->tail = 0;
    rb->length = 0;
}

static void rb_free(ringbuf_t *rb) {
    free(rb->data);
    rb->data = NULL;
}

static size_t rb_write(ringbuf_t *rb, const uint8_t *data, size_t len) {
    if (rb->length + len > rb->capacity) len = rb->capacity - rb->length;
    if (len == 0) return 0;
    size_t first = rb->capacity - rb->tail;
    if (len <= first) {
        memcpy(rb->data + rb->tail, data, len);
    } else {
        memcpy(rb->data + rb->tail, data, first);
        memcpy(rb->data, data + first, len - first);
    }
    rb->tail = (rb->tail + len) % rb->capacity;
    rb->length += len;
    return len;
}

static void rb_consume(ringbuf_t *rb, size_t len) {
    if (len > rb->length) len = rb->length;
    rb->head = (rb->head + len) % rb->capacity;
    rb->length -= len;
}

static size_t rb_peek(ringbuf_t *rb, uint8_t *out, size_t len) {
    if (len > rb->length) len = rb->length;
    if (len == 0) return 0;
    size_t first = rb->capacity - rb->head;
    if (len <= first) {
        memcpy(out, rb->data + rb->head, len);
    } else {
        memcpy(out, rb->data + rb->head, first);
        memcpy(out + first, rb->data, len - first);
    }
    return len;
}

static uint8_t rb_peek_byte(ringbuf_t *rb) {
    return rb->data[rb->head];
}

static uint8_t *build_login_request(size_t *out_len) {
    pb_encoder_t setting_enc;
    pb_encoder_init(&setting_enc);
    pb_encode_string(&setting_enc, 1, "new_vc");
    pb_encode_string(&setting_enc, 2, "1");
    size_t setting_len;
    uint8_t *setting_bytes = pb_encoder_detach(&setting_enc, &setting_len);

    char android_id_str[32];
    char security_token_str[32];
    char device_id_str[48];
    snprintf(android_id_str, sizeof(android_id_str), "%llu", (unsigned long long)g_fcm_state.android_id);
    snprintf(security_token_str, sizeof(security_token_str), "%llu", (unsigned long long)g_fcm_state.security_token);
    snprintf(device_id_str, sizeof(device_id_str), "android-%llx", (unsigned long long)g_fcm_state.android_id);

    pb_encoder_t enc;
    pb_encoder_init(&enc);
    pb_encode_string(&enc, 1, "chrome-63.0.3234.0");
    pb_encode_string(&enc, 2, "mcs.android.com");
    pb_encode_string(&enc, 3, android_id_str);
    pb_encode_string(&enc, 4, android_id_str);
    pb_encode_string(&enc, 5, security_token_str);
    pb_encode_string(&enc, 6, device_id_str);
    pb_encode_bytes(&enc, 8, setting_bytes, setting_len);
    pb_encode_bool(&enc, 12, false);
    pb_encode_bool(&enc, 14, true);
    pb_encode_int32(&enc, 16, 2);
    pb_encode_int32(&enc, 17, 1);

    size_t payload_len;
    uint8_t *payload = pb_encoder_detach(&enc, &payload_len);
    free(setting_bytes);

    uint8_t varint_buf[5];
    int varint_len = pb_put_uvarint(varint_buf, sizeof(varint_buf), payload_len);
    size_t packet_len = 2 + varint_len + payload_len;
    uint8_t *packet = (uint8_t *)malloc(packet_len);
    if (!packet) {
        free(payload);
        return NULL;
    }
    packet[0] = KMCS_VERSION;
    packet[1] = K_LOGIN_REQUEST_TAG;
    memcpy(packet + 2, varint_buf, varint_len);
    memcpy(packet + 2 + varint_len, payload, payload_len);
    free(payload);
    *out_len = packet_len;
    return packet;
}

static void parse_app_data(const uint8_t *data, size_t len, fcm_app_data_t *out) {
    pb_decoder_t d;
    pb_decoder_init(&d, data, len);
    out->key[0] = '\0';
    out->value[0] = '\0';
    while (pb_decoder_remaining(&d) > 0) {
        uint32_t field;
        uint8_t wt;
        if (pb_decode_field(&d, &field, &wt) != 0) break;
        if (field == 1) pb_decode_string(&d, out->key, sizeof(out->key), NULL);
        else if (field == 2) pb_decode_string(&d, out->value, sizeof(out->value), NULL);
        else pb_skip_field(&d, wt);
    }
}

static void parse_data_message(const uint8_t *data, size_t len, fcm_message_t *msg) {
    memset(msg, 0, sizeof(*msg));
    pb_decoder_t d;
    pb_decoder_init(&d, data, len);
    while (pb_decoder_remaining(&d) > 0) {
        uint32_t field;
        uint8_t wt;
        if (pb_decode_field(&d, &field, &wt) != 0) break;
        switch (field) {
            case 2: pb_decode_string(&d, msg->id, sizeof(msg->id), NULL); break;
            case 3: pb_decode_string(&d, msg->from, sizeof(msg->from), NULL); break;
            case 4: pb_decode_string(&d, msg->to, sizeof(msg->to), NULL); break;
            case 5: pb_decode_string(&d, msg->category, sizeof(msg->category), NULL); break;
            case 7: {
                const uint8_t *sub;
                size_t sub_len;
                if (pb_decode_bytes(&d, &sub, &sub_len) == 0 && msg->app_data_count < 16) {
                    parse_app_data(sub, sub_len, &msg->app_data[msg->app_data_count++]);
                }
                break;
            }
            case 9: pb_decode_string(&d, msg->persistent_id, sizeof(msg->persistent_id), NULL); break;
            case 17: { int32_t ttl; if (pb_decode_int32(&d, &ttl) == 0) msg->ttl = ttl; break; }
            case 21: {
                const uint8_t *raw;
                size_t raw_len;
                if (pb_decode_bytes(&d, &raw, &raw_len) == 0) {
                    msg->raw_data = (uint8_t *)malloc(raw_len);
                    if (msg->raw_data) {
                        memcpy(msg->raw_data, raw, raw_len);
                        msg->raw_data_len = raw_len;
                    }
                }
                break;
            }
            case 24: { bool ack; if (pb_decode_bool(&d, &ack) == 0) msg->immediate_ack = ack; break; }
            default: pb_skip_field(&d, wt); break;
        }
    }
}

static const char *find_app_data(const fcm_message_t *msg, const char *key) {
    for (int i = 0; i < msg->app_data_count; i++) {
        if (strcmp(msg->app_data[i].key, key) == 0) return msg->app_data[i].value;
    }
    return NULL;
}

static String json_string_value(const String &json, const char *key) {
    String needle = String("\"") + key + "\":\"";
    int start = json.indexOf(needle);
    if (start < 0) return String();
    start += needle.length();
    int end = start;
    while (end < (int)json.length()) {
        if (json[end] == '\\') {
            end += 2;
            continue;
        }
        if (json[end] == '\"') break;
        end++;
    }
    String value = json.substring(start, end);
    value.replace("\\\"", "\"");
    value.replace("\\/", "/");
    return value;
}

static fcm_notif_data_t *parse_notif_json_esp8266(const char *json_str) {
    if (!json_str) return NULL;
    String json(json_str);
    fcm_notif_data_t *nd = (fcm_notif_data_t *)calloc(1, sizeof(fcm_notif_data_t));
    if (!nd) return NULL;

