agusibrahim/esp-fcm-arduino/src/fcm_mcs_esp8266.cpp
    String title = json_string_value(json, "title");
    String body = json_string_value(json, "body");
    String message_id = json_string_value(json, "fcmMessageId");
    String from = json_string_value(json, "from");
    String priority = json_string_value(json, "priority");
    if (title.length()) snprintf(nd->title, sizeof(nd->title), "%s", title.c_str());
    if (body.length()) snprintf(nd->body, sizeof(nd->body), "%s", body.c_str());
    if (message_id.length()) snprintf(nd->fcm_message_id, sizeof(nd->fcm_message_id), "%s", message_id.c_str());
    if (from.length()) snprintf(nd->from, sizeof(nd->from), "%s", from.c_str());
    if (priority.length()) snprintf(nd->priority, sizeof(nd->priority), "%s", priority.c_str());

    if (!nd->title[0] && !nd->body[0] && !nd->fcm_message_id[0]) {
        free(nd);
        return NULL;
    }
    return nd;
}

static esp_err_t decrypt_message_via_server(fcm_message_t *msg) {
    if (!s_current_config || !s_current_config->decrypt_api_url || !s_current_config->decrypt_api_url[0]) return ESP_ERR_INVALID_STATE;
    const char *crypto_key = find_app_data(msg, "crypto-key");
    const char *encryption = find_app_data(msg, "encryption");
    if (!crypto_key || !encryption || !msg->raw_data || msg->raw_data_len == 0) return ESP_ERR_INVALID_ARG;

    size_t raw_b64_len = ((msg->raw_data_len * 4) + 2) / 3 + 1;
    char *raw_b64 = (char *)malloc(raw_b64_len);
    if (!raw_b64) return ESP_ERR_NO_MEM;

    size_t encoded_len = 0;
    if (fcm_base64url_encode(msg->raw_data, msg->raw_data_len, raw_b64, raw_b64_len, &encoded_len) != 0) {
        free(raw_b64);
        return ESP_FAIL;
    }

    size_t body_len = strlen(g_fcm_state.private_key_b64) + strlen(g_fcm_state.auth_secret_b64) +
                      strlen(crypto_key) + strlen(encryption) + strlen(raw_b64) + 160;
    char *body = (char *)malloc(body_len);
    if (!body) {
        free(raw_b64);
        return ESP_ERR_NO_MEM;
    }

    snprintf(body, body_len,
             "{\"privateKey\":\"%s\",\"authSecret\":\"%s\",\"cryptoKey\":\"%s\",\"encryption\":\"%s\",\"rawData\":\"%s\"}",
             g_fcm_state.private_key_b64,
             g_fcm_state.auth_secret_b64,
             crypto_key,
             encryption,
             raw_b64);

    bool is_https = strncmp(s_current_config->decrypt_api_url, "https://", 8) == 0;
    BearSSL::WiFiClientSecure tls_client;
    WiFiClient plain_client;
    WiFiClient *client_ptr = NULL;
    if (is_https) {
        tls_client.setInsecure();
        client_ptr = &tls_client;
    } else {
        client_ptr = &plain_client;
    }
    HTTPClient http;
    esp_err_t result = ESP_FAIL;
    if (http.begin(*client_ptr, s_current_config->decrypt_api_url)) {
        http.setReuse(false);
        http.setTimeout(15000);
        http.useHTTP10(true);
        http.addHeader("Content-Type", "application/json");
        http.addHeader("Connection", "close");
        int code = http.POST((uint8_t *)body, strlen(body));
        if (code >= 200 && code < 300) {
            String response = http.getString();
            if (response.indexOf("\"success\":true") >= 0) {
                String text = json_string_value(response, "text");
                if (text.length()) {
                    msg->json_data = (char *)malloc(text.length() + 1);
                    if (msg->json_data) {
                        memcpy(msg->json_data, text.c_str(), text.length() + 1);
                        msg->notif_data = parse_notif_json_esp8266(msg->json_data);
                        result = ESP_OK;
                    } else {
                        result = ESP_ERR_NO_MEM;
                    }
                }
            }
        } else {
            printf("[FCM] Server decrypt failed: %d\n", code);
        }
        http.end();
    }

    free(body);
    free(raw_b64);
    return result;
}

static void decrypt_message_if_needed(fcm_message_t *msg) {
    const char *crypto_key_str = NULL;
    const char *encryption_str = NULL;
    for (int i = 0; i < msg->app_data_count; i++) {
        if (strcmp(msg->app_data[i].key, "crypto-key") == 0) crypto_key_str = msg->app_data[i].value;
        else if (strcmp(msg->app_data[i].key, "encryption") == 0) encryption_str = msg->app_data[i].value;
    }
    if (!crypto_key_str || !encryption_str || !msg->raw_data || msg->raw_data_len == 0) {
        return;
    }

    const char *dh_start = strstr(crypto_key_str, "dh=");
    const char *salt_start = strstr(encryption_str, "salt=");
    if (!dh_start || !salt_start) return;
    dh_start += 3;
    salt_start += 5;
    const char *dh_end = strchr(dh_start, ';');
    const char *salt_end = strchr(salt_start, ';');
    size_t dh_len = dh_end ? (size_t)(dh_end - dh_start) : strlen(dh_start);
    size_t salt_str_len = salt_end ? (size_t)(salt_end - salt_start) : strlen(salt_start);

    uint8_t server_pub[128];
    size_t server_pub_len = 0;
    uint8_t salt[64];
    size_t salt_len = 0;
    if (fcm_base64url_decode(dh_start, dh_len, server_pub, sizeof(server_pub), &server_pub_len) != 0) return;
    if (fcm_base64url_decode(salt_start, salt_str_len, salt, sizeof(salt), &salt_len) != 0) return;
#ifndef FCM_ESP8266_ENABLE_BLOCKING_ECDH
    return;
#endif

    uint8_t *plaintext = (uint8_t *)malloc(msg->raw_data_len);
    size_t plaintext_len = 0;
    if (!plaintext) return;
    if (fcm_decrypt(server_pub, server_pub_len, salt, salt_len,
                    msg->raw_data, msg->raw_data_len, plaintext, &plaintext_len) == ESP_OK && plaintext_len > 0) {
        msg->json_data = (char *)malloc(plaintext_len + 1);
        if (msg->json_data) {
            memcpy(msg->json_data, plaintext, plaintext_len);
            msg->json_data[plaintext_len] = '\0';
        }
    }
    free(plaintext);
}

static esp_err_t send_heartbeat(BearSSL::WiFiClientSecure *client) {
    uint8_t pkt[2] = { TAG_HEARTBEAT_PING, 0 };
    return client->write(pkt, sizeof(pkt)) == sizeof(pkt) ? ESP_OK : ESP_FAIL;
}

static esp_err_t send_ack(BearSSL::WiFiClientSecure *client, const char *id) {
    pb_encoder_t ack_enc;
    pb_encoder_init(&ack_enc);
    pb_encode_string(&ack_enc, 3, id);
    size_t ack_len;
    uint8_t *ack_payload = pb_encoder_detach(&ack_enc, &ack_len);
    if (!ack_payload) return ESP_ERR_NO_MEM;

    uint8_t varint[5];
    int var_len = pb_put_uvarint(varint, sizeof(varint), ack_len);
    size_t pkt_len = 2 + var_len + ack_len;
    uint8_t *pkt = (uint8_t *)malloc(pkt_len);
    if (!pkt) {
        free(ack_payload);
        return ESP_ERR_NO_MEM;
    }
    pkt[0] = KMCS_VERSION;
    pkt[1] = TAG_IQ_STANZA;
    memcpy(pkt + 2, varint, var_len);
    memcpy(pkt + 2 + var_len, ack_payload, ack_len);
    size_t written = client->write(pkt, pkt_len);
    free(pkt);
    free(ack_payload);
    return written == pkt_len ? ESP_OK : ESP_FAIL;
}

static esp_err_t fcm_start_internal(fcm_message_cb_t callback) {
    if (WiFi.status() != WL_CONNECTED) {
        printf("[FCM] ESP8266 WiFi disconnected, waiting reconnect\n");
        uint32_t deadline = millis() + 30000;
        while (WiFi.status() != WL_CONNECTED && millis() < deadline) {
            delay(500);
            yield();
        }
        if (WiFi.status() != WL_CONNECTED) {
            return ESP_FAIL;
        }
    }
    BearSSL::WiFiClientSecure *client = new BearSSL::WiFiClientSecure();
    if (!client) return ESP_ERR_NO_MEM;
    client->setBufferSizes(512, 512);
    client->setTimeout(100);
    client->setNoDelay(true);
#if defined(FCM_ESP8266_STRICT_TLS)
    BearSSL::X509List cert(GOOGLE_ROOT_CA_PEM);
    client->setTrustAnchors(&cert);
#else
    client->setInsecure();
#endif

    printf("[FCM] ESP8266 connecting to %s:%d, free heap=%u\n", MCS_HOST, MCS_PORT, ESP.getFreeHeap());
    if (!client->connect(MCS_HOST, MCS_PORT)) {
        printf("[FCM] ERROR: ESP8266 MCS TLS connect failed, free heap=%u\n", ESP.getFreeHeap());
        client->stop();
        delete client;
        delay(100);
        return ESP_FAIL;
    }

    size_t login_len;
    uint8_t *login = build_login_request(&login_len);
    if (!login) return ESP_ERR_NO_MEM;
    if (client->write(login, login_len) != login_len) {
        free(login);
        return ESP_FAIL;
    }
    free(login);
    client->flush();
    ESP.wdtFeed();
    yield();
    load_last_timestamp();

    if (s_current_config && s_current_config->status_cb) s_current_config->status_cb(FCM_STATUS_CONNECTED);

    ringbuf_t rb;
    rb_init(&rb, FCM_READ_BUF_SIZE);
    if (!rb.data) return ESP_ERR_NO_MEM;

    uint8_t temp[512];
    uint8_t state = 0;
    uint8_t current_tag = 0;
    size_t expected_size = 0;
    uint32_t last_heartbeat = millis();
    uint32_t last_poll = 0;
    esp_err_t result = ESP_OK;

