agusibrahim/esp-fcm-arduino/src/fcm_mcs_esp8266.cpp
    while (client->connected()) {
        if (s_should_stop_cb && s_should_stop_cb()) {
            result = ESP_OK;
            goto done;
        }
        ESP.wdtFeed();
        delay(1);
        if (millis() - last_poll < 50) continue;
        last_poll = millis();
        int available = client->available();
        if (available > 0) {
            int to_read = available > (int)sizeof(temp) ? (int)sizeof(temp) : available;
            int n = client->read(temp, to_read);
            if (n > 0) {
                rb_write(&rb, temp, (size_t)n);
            }
        } else {
            delay(50);
        }

        bool progress;
        do {
            ESP.wdtFeed();
            progress = false;
            if (state == 0 && rb.length >= 1) {
                uint8_t version = rb_peek_byte(&rb);
                rb_consume(&rb, 1);
                if (version != KMCS_VERSION) {
                    result = ESP_FAIL;
                    goto done;
                }
                state = 1;
                progress = true;
            } else if (state == 1 && rb.length >= 1) {
                current_tag = rb_peek_byte(&rb);
                rb_consume(&rb, 1);
                state = 2;
                progress = true;
            } else if (state == 2) {
                uint8_t vbuf[5];
                size_t peek_len = rb.length < sizeof(vbuf) ? rb.length : sizeof(vbuf);
                rb_peek(&rb, vbuf, peek_len);
                size_t consumed = 0;
                int vr = pb_try_read_varint(vbuf, peek_len, &expected_size, &consumed);
                if (vr == 1) {
                    rb_consume(&rb, consumed);
                    if (expected_size == 0) {
                        if (current_tag == TAG_HEARTBEAT_PING) {
                            send_heartbeat(client);
                        } else if (current_tag == TAG_CLOSE) {
                            printf("[FCM] ERROR: ESP8266 server sent Close\n");
                            result = ESP_FAIL;
                            goto done;
                        }
                        state = 1;
                    } else {
                        state = 3;
                    }
                    progress = true;
                } else if (vr < 0) {
                    printf("[FCM] ERROR: ESP8266 invalid varint\n");
                    result = ESP_FAIL;
                    goto done;
                }
            } else if (state == 3 && rb.length >= expected_size) {
                uint8_t *payload = (uint8_t *)malloc(expected_size);
                if (!payload) {
                    result = ESP_ERR_NO_MEM;
                    goto done;
                }
                rb_peek(&rb, payload, expected_size);
                rb_consume(&rb, expected_size);

                if (current_tag == TAG_HEARTBEAT_PING) {
                    send_heartbeat(client);
                } else if (current_tag == TAG_HEARTBEAT_ACK || current_tag == TAG_LOGIN_RESPONSE || current_tag == TAG_IQ_STANZA) {
                } else if (current_tag == TAG_DATA_MESSAGE) {
                    fcm_message_t *msg = (fcm_message_t *)calloc(1, sizeof(fcm_message_t));
                    if (!msg) {
                        result = ESP_ERR_NO_MEM;
                        goto done;
                    }
                    parse_data_message(payload, expected_size, msg);

                    uint64_t msg_ts = parse_pid_timestamp(msg->persistent_id);
                    if (msg_ts > 0 && msg_ts <= s_last_ts) {
                        free(msg->raw_data);
                        free(msg);
                        free(payload);
                        state = 1;
                        progress = true;
                        continue;
                    }
                    if (msg->immediate_ack) {
                        send_ack(client, msg->id);
                    }

#if defined(FCM_DECRYPT_VIA_SERVER)
                    s_pending_server_msg = msg;
                    s_pending_callback = callback;
                    free(payload);
                    result = ESP_OK;
                    goto done;
#else
                    if (msg_ts > 0) {
                        save_last_timestamp(msg_ts);
                    }
                    decrypt_message_if_needed(msg);
                    msg->notif_data = parse_notif_json_esp8266(msg->json_data);
                    if (callback) callback(msg);
                    free(msg->notif_data);
                    free(msg->json_data);
                    free(msg->raw_data);
                    free(msg);
#endif
                } else if (current_tag == TAG_CLOSE) {
                    free(payload);
                    result = ESP_FAIL;
                    goto done;
                }

                free(payload);
                state = 1;
                progress = true;
            }
        } while (progress);

        if (millis() - last_heartbeat > g_fcm_heartbeat_interval_ms) {
            if (send_heartbeat(client) != ESP_OK) {
                printf("[FCM] ERROR: ESP8266 heartbeat send failed\n");
                result = ESP_FAIL;
                goto done;
            }
            last_heartbeat = millis();
        }
    }

    result = ESP_FAIL;

done:
    rb_free(&rb);
    if (client) {
        client->stop();
        delete client;
    }
    return result;
}

static void process_pending_server_decrypt(void) {
    if (!s_pending_server_msg) return;
    fcm_message_t *msg = s_pending_server_msg;
    fcm_message_cb_t callback = s_pending_callback;
    s_pending_server_msg = NULL;
    s_pending_callback = NULL;

    uint64_t msg_ts = parse_pid_timestamp(msg->persistent_id);
    delay(2000);
    yield();
    printf("[FCM] ESP8266 starting server decrypt, free heap=%u\n", ESP.getFreeHeap());
    if (decrypt_message_via_server(msg) == ESP_OK) {
        if (callback) callback(msg);
        if (msg_ts > 0) save_last_timestamp(msg_ts);
    }
    free(msg->notif_data);
    free(msg->json_data);
    free(msg->raw_data);
    free(msg);
}

extern "C" esp_err_t fcm_start(fcm_message_cb_t callback) {
    if (!s_current_config) return ESP_ERR_INVALID_STATE;
    bool auto_reconnect = s_current_config->auto_reconnect;
    esp_err_t last_err;
    do {
        if (s_current_config->status_cb) s_current_config->status_cb(FCM_STATUS_CONNECTING);
        last_err = fcm_start_internal(callback);
        if (s_current_config->status_cb) s_current_config->status_cb(FCM_STATUS_DISCONNECTED);
        process_pending_server_decrypt();
        if (auto_reconnect) delay(5000);
    } while (auto_reconnect);
    return last_err;
}

#endif
